; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	infrared2 - mode
	thermograph4 - mode
	infrared0 - mode
	spectrograph1 - mode
	image3 - mode
	Star4 - direction
	GroundStation12 - direction
	GroundStation15 - direction
	GroundStation19 - direction
	GroundStation26 - direction
	GroundStation17 - direction
	Star24 - direction
	Star38 - direction
	Star9 - direction
	GroundStation22 - direction
	GroundStation23 - direction
	GroundStation29 - direction
	GroundStation1 - direction
	GroundStation39 - direction
	GroundStation14 - direction
	GroundStation31 - direction
	GroundStation13 - direction
	GroundStation5 - direction
	Star32 - direction
	Star0 - direction
	GroundStation18 - direction
	GroundStation33 - direction
	Star21 - direction
	Star10 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation20 - direction
	GroundStation37 - direction
	Star8 - direction
	Star34 - direction
	Star11 - direction
	GroundStation30 - direction
	Star16 - direction
	GroundStation36 - direction
	GroundStation28 - direction
	GroundStation25 - direction
	GroundStation2 - direction
	Star35 - direction
	GroundStation27 - direction
	GroundStation6 - direction
	Star40 - direction
	Star41 - direction
	Phenomenon42 - direction
	Planet43 - direction
	Phenomenon44 - direction
	Star45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Planet48 - direction
	Planet49 - direction
	Phenomenon50 - direction
	Phenomenon51 - direction
	Planet52 - direction
	Phenomenon53 - direction
	Star54 - direction
	Star55 - direction
	Planet56 - direction
	Star57 - direction
	Planet58 - direction
	Star59 - direction
	Star60 - direction
	Planet61 - direction
	Phenomenon62 - direction
	Phenomenon63 - direction
	Phenomenon64 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation17)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star10)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star24)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star38)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation29)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation23)
	(calibration_target instrument3 GroundStation22)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation39)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation36)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation33)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation39)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 GroundStation33)
	(calibration_target instrument5 GroundStation18)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star32)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 GroundStation31)
	(calibration_target instrument5 Star10)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star41)
	(supports instrument6 infrared2)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 Star34)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation37)
	(calibration_target instrument6 GroundStation20)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star10)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 GroundStation36)
	(calibration_target instrument7 Star16)
	(calibration_target instrument7 GroundStation30)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 GroundStation27)
	(calibration_target instrument8 Star35)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation25)
	(calibration_target instrument8 GroundStation28)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon62)
)
(:goal (and
	(pointing satellite0 GroundStation18)
	(pointing satellite1 Phenomenon46)
	(have_image Star40 infrared0)
	(have_image Star41 spectrograph1)
	(have_image Phenomenon42 spectrograph1)
	(have_image Planet43 infrared2)
	(have_image Phenomenon44 thermograph4)
	(have_image Star45 thermograph4)
	(have_image Phenomenon46 image3)
	(have_image Planet47 infrared0)
	(have_image Planet48 infrared0)
	(have_image Planet49 thermograph4)
	(have_image Phenomenon50 infrared2)
	(have_image Phenomenon51 infrared2)
	(have_image Planet52 spectrograph1)
	(have_image Phenomenon53 infrared0)
	(have_image Star54 image3)
	(have_image Star55 infrared0)
	(have_image Planet56 infrared2)
	(have_image Star57 spectrograph1)
	(have_image Planet58 image3)
	(have_image Star59 infrared2)
	(have_image Star60 image3)
	(have_image Planet61 image3)
	(have_image Phenomenon62 spectrograph1)
	(have_image Phenomenon63 image3)
	(have_image Phenomenon64 infrared2)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 27
2. (calibrate satellite2 instrument6 star8)
   added: (calibrated instrument6)
   goals met: 0 of 27
3. (turn_to satellite2 phenomenon44 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon44)
   goals met: 0 of 27
4. (take_image satellite2 phenomenon44 instrument6 thermograph4)
   added: (have_image phenomenon44 thermograph4)
   goals met: 1 of 27
5. (turn_to satellite2 phenomenon50 phenomenon44)
   deleted: (pointing satellite2 phenomenon44)
   added: (pointing satellite2 phenomenon50)
   goals met: 1 of 27
6. (take_image satellite2 phenomenon50 instrument6 infrared2)
   added: (have_image phenomenon50 infrared2)
   goals met: 2 of 27
7. (turn_to satellite2 phenomenon51 phenomenon50)
   deleted: (pointing satellite2 phenomenon50)
   added: (pointing satellite2 phenomenon51)
   goals met: 2 of 27
8. (take_image satellite2 phenomenon51 instrument6 infrared2)
   added: (have_image phenomenon51 infrared2)
   goals met: 3 of 27
9. (turn_to satellite2 phenomenon53 phenomenon51)
   deleted: (pointing satellite2 phenomenon51)
   added: (pointing satellite2 phenomenon53)
   goals met: 3 of 27
10. (take_image satellite2 phenomenon53 instrument6 infrared0)
   added: (have_image phenomenon53 infrared0)
   goals met: 4 of 27
11. (turn_to satellite2 phenomenon64 phenomenon53)
   deleted: (pointing satellite2 phenomenon53)
   added: (pointing satellite2 phenomenon64)
   goals met: 4 of 27
12. (take_image satellite2 phenomenon64 instrument6 infrared2)
   added: (have_image phenomenon64 infrared2)
   goals met: 5 of 27
13. (turn_to satellite2 planet43 phenomenon64)
   deleted: (pointing satellite2 phenomenon64)
   added: (pointing satellite2 planet43)
   goals met: 5 of 27
14. (take_image satellite2 planet43 instrument6 infrared2)
   added: (have_image planet43 infrared2)
   goals met: 6 of 27
15. (turn_to satellite2 planet47 planet43)
   deleted: (pointing satellite2 planet43)
   added: (pointing satellite2 planet47)
   goals met: 6 of 27
16. (take_image satellite2 planet47 instrument6 infrared0)
   added: (have_image planet47 infrared0)
   goals met: 7 of 27
17. (turn_to satellite2 planet48 planet47)
   deleted: (pointing satellite2 planet47)
   added: (pointing satellite2 planet48)
   goals met: 7 of 27
18. (take_image satellite2 planet48 instrument6 infrared0)
   added: (have_image planet48 infrared0)
   goals met: 8 of 27
19. (turn_to satellite2 planet49 planet48)
   deleted: (pointing satellite2 planet48)
   added: (pointing satellite2 planet49)
   goals met: 8 of 27
20. (take_image satellite2 planet49 instrument6 thermograph4)
   added: (have_image planet49 thermograph4)
   goals met: 9 of 27
21. (turn_to satellite2 planet56 planet49)
   deleted: (pointing satellite2 planet49)
   added: (pointing satellite2 planet56)
   goals met: 9 of 27
22. (take_image satellite2 planet56 instrument6 infrared2)
   added: (have_image planet56 infrared2)
   goals met: 10 of 27
23. (turn_to satellite2 star40 planet56)
   deleted: (pointing satellite2 planet56)
   added: (pointing satellite2 star40)
   goals met: 10 of 27
24. (take_image satellite2 star40 instrument6 infrared0)
   added: (have_image star40 infrared0)
   goals met: 11 of 27
25. (turn_to satellite2 star45 star40)
   deleted: (pointing satellite2 star40)
   added: (pointing satellite2 star45)
   goals met: 11 of 27
26. (take_image satellite2 star45 instrument6 thermograph4)
   added: (have_image star45 thermograph4)
   goals met: 12 of 27
27. (turn_to satellite2 star55 star45)
   deleted: (pointing satellite2 star45)
   added: (pointing satellite2 star55)
   goals met: 12 of 27
28. (take_image satellite2 star55 instrument6 infrared0)
   added: (have_image star55 infrared0)
   goals met: 13 of 27
29. (turn_to satellite2 star59 star55)
   deleted: (pointing satellite2 star55)
   added: (pointing satellite2 star59)
   goals met: 13 of 27
30. (take_image satellite2 star59 instrument6 infrared2)
   added: (have_image star59 infrared2)
   goals met: 14 of 27
31. (turn_to satellite1 phenomenon46 star41)
   deleted: (pointing satellite1 star41)
   added: (pointing satellite1 phenomenon46)
   goals met: 15 of 27
32. (turn_to satellite0 groundstation18 groundstation36)
   deleted: (pointing satellite0 groundstation36)
   added: (pointing satellite0 groundstation18)
   goals met: 16 of 27
33. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 16 of 27
34. (turn_to satellite0 star10 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 star10)
   goals met: 15 of 27
35. (calibrate satellite0 instrument0 star10)
   added: (calibrated instrument0)
   goals met: 15 of 27
36. (turn_to satellite0 groundstation18 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation18)
   goals met: 16 of 27
37. (turn_to satellite0 phenomenon46 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon46)
   goals met: 15 of 27
38. (take_image satellite0 phenomenon46 instrument0 image3)
   added: (have_image phenomenon46 image3)
   goals met: 16 of 27
39. (turn_to satellite0 groundstation18 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 groundstation18)
   goals met: 17 of 27
40. (turn_to satellite0 phenomenon63 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon63)
   goals met: 16 of 27
41. (take_image satellite0 phenomenon63 instrument0 image3)
   added: (have_image phenomenon63 image3)
   goals met: 17 of 27
42. (turn_to satellite0 groundstation18 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 groundstation18)
   goals met: 18 of 27
43. (turn_to satellite0 planet58 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 planet58)
   goals met: 17 of 27
44. (take_image satellite0 planet58 instrument0 image3)
   added: (have_image planet58 image3)
   goals met: 18 of 27
45. (turn_to satellite0 groundstation18 planet58)
   deleted: (pointing satellite0 planet58)
   added: (pointing satellite0 groundstation18)
   goals met: 19 of 27
46. (turn_to satellite0 planet61 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 planet61)
   goals met: 18 of 27
47. (take_image satellite0 planet61 instrument0 image3)
   added: (have_image planet61 image3)
   goals met: 19 of 27
48. (turn_to satellite0 groundstation18 planet61)
   deleted: (pointing satellite0 planet61)
   added: (pointing satellite0 groundstation18)
   goals met: 20 of 27
49. (turn_to satellite0 star54 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 star54)
   goals met: 19 of 27
50. (take_image satellite0 star54 instrument0 image3)
   added: (have_image star54 image3)
   goals met: 20 of 27
51. (turn_to satellite0 groundstation18 star54)
   deleted: (pointing satellite0 star54)
   added: (pointing satellite0 groundstation18)
   goals met: 21 of 27
52. (turn_to satellite0 star60 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 star60)
   goals met: 20 of 27
53. (take_image satellite0 star60 instrument0 image3)
   added: (have_image star60 image3)
   goals met: 21 of 27
54. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 21 of 27
55. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 21 of 27
56. (turn_to satellite0 groundstation18 star60)
   deleted: (pointing satellite0 star60)
   added: (pointing satellite0 groundstation18)
   goals met: 22 of 27
57. (turn_to satellite0 star24 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 star24)
   goals met: 21 of 27
58. (calibrate satellite0 instrument1 star24)
   added: (calibrated instrument1)
   goals met: 21 of 27
59. (turn_to satellite0 groundstation18 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 groundstation18)
   goals met: 22 of 27
60. (turn_to satellite0 phenomenon42 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon42)
   goals met: 21 of 27
61. (take_image satellite0 phenomenon42 instrument1 spectrograph1)
   added: (have_image phenomenon42 spectrograph1)
   goals met: 22 of 27
62. (turn_to satellite0 groundstation18 phenomenon42)
   deleted: (pointing satellite0 phenomenon42)
   added: (pointing satellite0 groundstation18)
   goals met: 23 of 27
63. (turn_to satellite0 phenomenon62 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon62)
   goals met: 22 of 27
64. (take_image satellite0 phenomenon62 instrument1 spectrograph1)
   added: (have_image phenomenon62 spectrograph1)
   goals met: 23 of 27
65. (turn_to satellite0 groundstation18 phenomenon62)
   deleted: (pointing satellite0 phenomenon62)
   added: (pointing satellite0 groundstation18)
   goals met: 24 of 27
66. (turn_to satellite0 planet52 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 planet52)
   goals met: 23 of 27
67. (take_image satellite0 planet52 instrument1 spectrograph1)
   added: (have_image planet52 spectrograph1)
   goals met: 24 of 27
68. (turn_to satellite0 groundstation18 planet52)
   deleted: (pointing satellite0 planet52)
   added: (pointing satellite0 groundstation18)
   goals met: 25 of 27
69. (turn_to satellite0 star41 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 star41)
   goals met: 24 of 27
70. (take_image satellite0 star41 instrument1 spectrograph1)
   added: (have_image star41 spectrograph1)
   goals met: 25 of 27
71. (turn_to satellite0 groundstation18 star41)
   deleted: (pointing satellite0 star41)
   added: (pointing satellite0 groundstation18)
   goals met: 26 of 27
72. (turn_to satellite0 star57 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 star57)
   goals met: 25 of 27
73. (take_image satellite0 star57 instrument1 spectrograph1)
   added: (have_image star57 spectrograph1)
   goals met: 26 of 27
74. (turn_to satellite0 groundstation18 star57)
   deleted: (pointing satellite0 star57)
   added: (pointing satellite0 groundstation18)
   goals met: 27 of 27
